We have the same issue. Despite there are no changes in the Terraform configuration, every time we run a plan o apply, we have the following result:

```shell
~ resource "ec_deployment" "deployment" {
      + apm_secret_token       = (sensitive value)
      ~ elasticsearch          = {
          ~ cloud_id       = "<cloud_id_value>" -> (known after apply)
          ~ http_endpoint  = "<http_endpoint_value>" -> (known after apply)
          ~ https_endpoint = "<https://endpoint:443>" -> (known after apply)
          ~ resource_id    = "<resource_id_value" -> (known after apply)
            # (11 unchanged attributes hidden)
        }
        id                     = "<id_value>"
        name                   = "<name>"
        # (8 unchanged attributes hidden)
    }
``` 

Terraform Version: 1.5.2
Provider Version: 0.7.0
